OldTests/Linux-BareMetal/benchmark_raw_20260414_154627/raw_logs/fio_seq_rw_raw.txt
seq_rw: (g=0): rw=rw, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=psync, iodepth=8
fio-3.36
Starting 1 process
note: both iodepth >= 1 and synchronous I/O engine are selected, queue depth will be capped at 1

seq_rw: (groupid=0, jobs=1): err= 0: pid=308768: Tue Apr 14 15:57:31 2026
  read: IOPS=150, BW=151MiB/s (158MB/s)(9042MiB/60003msec)
    clat (usec): min=2067, max=59344, avg=3329.32, stdev=2388.55
     lat (usec): min=2067, max=59345, avg=3330.23, stdev=2388.55
    clat percentiles (usec):
     |  1.00th=[ 2147],  5.00th=[ 2311], 10.00th=[ 2343], 20.00th=[ 2343],
     | 30.00th=[ 2376], 40.00th=[ 2442], 50.00th=[ 2900], 60.00th=[ 3326],
     | 70.00th=[ 3621], 80.00th=[ 4015], 90.00th=[ 4555], 95.00th=[ 5145],
     | 99.00th=[ 8848], 99.50th=[14746], 99.90th=[53740], 99.95th=[56886],
     | 99.99th=[59507]
   bw (  KiB/s): min=120832, max=208896, per=100.00%, avg=154529.34, stdev=17055.26, samples=119
   iops        : min=  118, max=  204, avg=150.91, stdev=16.66, samples=119
  write: IOPS=150, BW=151MiB/s (158MB/s)(9036MiB/60003msec); 0 zone resets
    clat (usec): min=2072, max=52275, avg=3214.48, stdev=1844.23
     lat (usec): min=2104, max=52354, avg=3287.01, stdev=1844.41
    clat percentiles (usec):
     |  1.00th=[ 2147],  5.00th=[ 2343], 10.00th=[ 2343], 20.00th=[ 2376],
     | 30.00th=[ 2540], 40.00th=[ 2802], 50.00th=[ 3130], 60.00th=[ 3458],
     | 70.00th=[ 3556], 80.00th=[ 3654], 90.00th=[ 3851], 95.00th=[ 4080],
     | 99.00th=[ 6652], 99.50th=[10814], 99.90th=[44303], 99.95th=[49021],
     | 99.99th=[52167]
   bw (  KiB/s): min=110592, max=186368, per=99.99%, avg=154185.14, stdev=18068.06, samples=119
   iops        : min=  108, max=  182, avg=150.57, stdev=17.64, samples=119
  lat (msec)   : 4=86.83%, 10=12.42%, 20=0.61%, 50=0.06%, 100=0.08%
  cpu          : usr=2.05%, sys=6.94%, ctx=18081, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=9042,9036,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=151MiB/s (158MB/s), 151MiB/s-151MiB/s (158MB/s-158MB/s), io=9042MiB (9481MB), run=60003-60003msec
  WRITE: bw=151MiB/s (158MB/s), 151MiB/s-151MiB/s (158MB/s-158MB/s), io=9036MiB (9475MB), run=60003-60003msec

Disk stats (read/write):
  sda: ios=9024/9052, sectors=18481152/18465200, merge=0/19, ticks=28562/27646, in_queue=56222, util=92.68%